title: Suspicious HTTP POST Request to Known SilentSync RAT C2 Domain
id:
status: draft
description: Detects HTTP POST requests to the known SilentSync RAT command and control (C2) domain associated with the malicious PyPI packages 'pytoileur' and 'pymargin'.
references:
  - https://thehackernews.com/2025/09/silentsync-rat-delivered-via-two.html
author:
date: '2024-06-24'
logsource:
  category: network
  product: zeek
  service: http
detection:
  selection:
    http.method: 'POST'
    http.host: 'cdn.mypic.cc'
    http.uri: '/api/upload'
  condition: selection
falsepositives: Legitimate software or services uploading data to a similarly named domain could trigger this alert. Whitelisting known good applications that perform uploads to external services is recommended.
level: high
tags:
  - attack.command_and_control
  - attack.t1071.001
  - attack.exfiltration
  - attack.t1048
  - attack.t1588.002